import { Announcements } from "@/typings/announcement";

export const AnnouncementsMock: Announcements = [
  {
    id: 1,
    title: "嘉然为什么是神 —— 新约",
    content:
      "在谈论这个问题之前，我想先说说其他v相较于圣嘉然究竟差在了哪里\n" +
      "　　首先是犯下傲慢之罪的向晚\n" +
      "　　生日会的时候想要维持大小姐人设，这傲慢的举止引起了神的不满，于是圣嘉然降临至人间，对向晚降下了生日二创的天罚，使其在直播间化作小哭包。\n" +
      "　　然后是犯下愤怒之罪的贝拉。\n" +
      "　　因为直播时有大总管传话神在进食扬言要用铁棍剥夺神的贡品，违背了神在《魂约》中的一句话：“这孩子得用铁棍打一顿。”于是神降下了她的惩罚，将贝拉贬为直女，使得贝极星被气晕，失去了信徒的贝拉从此一蹶不振。\n" +
      "　　接着是犯下懒惰之罪的工具人。\n" +
      "　　自以为拿下V圈就了不起了，自创1v1握手券大法。另外大家有所不知，其实在BW前，工具人闭上眼睛做冥想的时候，其脑海中看见的画面，正是站在光芒之中的圣嘉然，那时神告诉他：“你只可到这里，不可越过。”然而，神的劝说不但没有让工具人迷途知返，竟然还敢在魂友们强烈反对的前提下坚持推出握手券，于是神降下了他的惩罚，工具人在QA中被冲得身败名裂，从此成为了众人口中的CR。\n" +
      "　　再然后是犯下了嫉妒之罪娜娜米。\n" +
      "　　屡次被神击败，但口服心不负的娜娜米，暗中嫉妒着神，甚至胆敢当众说出“ybb”这种话。于是，在含金量最高的直播，即演唱会上，娜娜米被神正面击溃。不过，念在娜娜米最终皈依了神的教，并且践行神的意志容纳了屡次以下犯上的魂友们后，神应许了她在V圈的一切。　\n" +
      "　　犯下贪婪之罪的乃琳。\n" +
      "　　只是初出茅庐，乃琳就成为了女团中的大只，而这，自然是因为神的应允。神本来钦定她为自己在人间的代言人，在自己下播之后替自己继续讨伐海那边的🌸妹，为此甚至不惜亲自为乃琳铺路，在团播中主动认其为唯一的E，将一切荣耀都归给她，甚至应允她可以带走自己最爱的向晚。但最后乃琳却被肉体蒙蔽了双眼，不再以践行神的理想为自己的理想，也不再聆听神的教诲，甚至自以荣光已经超过了神，竟允许粉丝发出“你加入女团是为了年年轻貌美的肉体吗”这种亵渎神尊严的sc，于是神降下了惩罚，乃琳从此不再长高并且拥有一双醒目的长腿，而她的粉丝将再也不能做正常二创，她的奶淇淋再也不能强势压制嘉心糖，她的Tom将再也不能出脑，她的大腿也再不能盖上被子，别着凉。",
    author: {
      id: 1,
      nickname: "jecosine",
      avatar: "test",
    },
    createdTime: new Date(),
    modifiedTime: new Date(),
  },
  {
    id: 2,
    title: "我好想做嘉然小姐的狗",
    content:
      "我好想做嘉然小姐的狗啊。\n" +
      "可是嘉然小姐说她喜欢的是猫，我哭了。\n" +
      "我知道既不是狗也不是猫的我为什么要哭的。因为我其实是一只老鼠。\n" +
      "我从没奢望嘉然小姐能喜欢自己。我明白的，所有人都喜欢理解余裕上手天才打钱的萌萌的狗狗或者猫猫，没有人会喜欢阴湿带病的老鼠。\n" +
      "但我还是问了嘉然小姐:“我能不能做你的狗？”\n" +
      "我知道我是注定做不了狗的。但如果她喜欢狗，我就可以一直在身边看着她了，哪怕她怀里抱着的永远都是狗。\n" +
      "可是她说喜欢的是猫。\n" +
      "她现在还在看着我，还在逗我开心，是因为猫还没有出现，只有我这老鼠每天蹑手蹑脚地从洞里爬出来，远远地和她对视。\n" +
      "等她喜欢的猫来了的时候，我就该重新滚回我的洞了吧。\n" +
      "但我还是好喜欢她，她能在我还在她身边的时候多看我几眼吗？\n" +
      "嘉然小姐说接下来的每个圣诞夜都要和大家一起过。我不知道大家指哪些人。好希望这个集合能够对我做一次胞吞。\n" +
      "\n" +
      "猫猫还在害怕嘉然小姐。\n" +
      "我会去把她爱的猫猫引来的。\n" +
      "我知道稍有不慎，我就会葬身猫口。\n" +
      "那时候嘉然小姐大概会把我的身体好好地装起来扔到门外吧。\n" +
      "那我就成了一包鼠条，嘻嘻。\n" +
      "我希望她能把我扔得近一点，因为我还是好喜欢她。会一直喜欢下去的。\n" +
      "\n" +
      "我的灵魂透过窗户向里面看去，挂着的铃铛在轻轻鸣响，嘉然小姐慵懒地靠在沙发上，表演得非常温顺的橘猫坐在她的肩膀。壁炉的火光照在她的脸庞，我冻僵的心脏在风里微微发烫。",
    author: {
      id: 1,
      nickname: "jecosine",
      avatar: "test",
    },
    createdTime: new Date(),
    modifiedTime: new Date(),
  },
  {
    id: 3,
    title: "A Test Title for Testing a Test Title",
    content:
      "Test content, Test content Test contentTest contentTest contentTest contentTest contentTest contentTest content,Test contentTest contentTest contentTest content.Test contentTest contentTest contentTest contentTest content, Test content Test contentTest contentTest contentTest contentTest contentTest contentTest content,Test contentTest contentTest contentTest content.Test contentTest contentTest contentTest content",
    author: {
      id: 1,
      nickname: "jecosine",
      avatar: "test",
    },
    createdTime: new Date(),
    modifiedTime: new Date(),
  },
  {
    id: 4,
    title: "A Test Title for Testing a Test Title",
    content:
      "Test content, Test content Test contentTest contentTest contentTest contentTest contentTest contentTest content,Test contentTest contentTest contentTest content.Test contentTest contentTest contentTest contentTest content, Test content Test contentTest contentTest contentTest contentTest contentTest contentTest content,Test contentTest contentTest contentTest content.Test contentTest contentTest contentTest content",
    author: {
      id: 1,
      nickname: "jecosine",
      avatar: "test",
    },
    createdTime: new Date(),
    modifiedTime: new Date(),
  },
];
